---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.MassSurfaceData
source: html/f0c16ca2-b6c7-3217-fb07-71de808e2fdf.htm
---
# MassSurfaceData Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.